In [1]:
import pandas as pd
from pathlib import Path
import matplotlib.pyplot as plt
from sklearn.linear_model import LinearRegression

In [2]:
file_path = "../Resources/GlobalLandTemperaturesByState.csv"
global_temp_df = pd.read_csv(file_path)
global_temp_df.head()

           dt  AverageTemperature  AverageTemperatureUncertainty State Country
0  1855-05-01              25.544                          1.171  Acre  Brazil
1  1855-06-01              24.228                          1.103  Acre  Brazil
2  1855-07-01              24.371                          1.044  Acre  Brazil
3  1855-08-01              25.427                          1.073  Acre  Brazil
4  1855-09-01              25.675                          1.014  Acre  Brazil

In [3]:
# cast to to datetime
dt= lambda df_: pd.to_datetime(df_['dt'])

In [4]:
# Extract average Temp across United States since the begining of the 19th Century
US_temp_df = global_temp_df.loc[(global_temp_df['Country']=='United States') & (global_temp_df['dt'] >= '1930-01-01')]
US_temp_df

,dt,AverageTemperature,AverageTemperatureUncertainty,State,Country
9692,1930-01-01,6.993,0.335,Alabama,United States
9693,1930-02-01,11.584,0.241,Alabama,United States
9694,1930-03-01,10.817,0.143,Alabama,United States
9695,1930-04-01,17.718,0.335,Alabama,United States
9696,1930-05-01,21.984,0.222,Alabama,United States
...,...,...,...,...,...
626435,2013-05-01,10.607,0.208,Wyoming,United States
626436,2013-06-01,16.267,0.276,Wyoming,United States
626437,2013-07-01,20.222,0.133,Wyoming,United States
626438,2013-08-01,19.621,0.217,Wyoming,United States
626439,2013-09-01,15.811,1.101,Wyoming,United States

In [5]:
# drop the null values
cleanUS_temp_df = US_temp_df.dropna()
cleanUS_temp_df.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,State,Country
9692,1930-01-01,6.993,0.335,Alabama,United States
9693,1930-02-01,11.584,0.241,Alabama,United States
9694,1930-03-01,10.817,0.143,Alabama,United States
9695,1930-04-01,17.718,0.335,Alabama,United States
9696,1930-05-01,21.984,0.222,Alabama,United States

In [6]:
# check the unique coloumn
cleanUS_temp_df.nunique()

dt                                1005
AverageTemperature               31055
AverageTemperatureUncertainty      698
State                               51
Country                              1
dtype: int64

In [7]:
cleanUS_temp_df.dtypes

dt                                object
AverageTemperature               float64
AverageTemperatureUncertainty    float64
State                             object
Country                           object
dtype: object

In [8]:
cleanUS_temp_df.notnull().sum()

dt                               51253
AverageTemperature               51253
AverageTemperatureUncertainty    51253
State                            51253
Country                          51253
dtype: int64

In [9]:
# Recode the Columns
cleanUS_temp_df = cleanUS_temp_df.rename(columns={"dt":"Date",
                                                  "AverageTemperature":"Avg_temp",
                                                  "AverageTemperatureUncertainty":"Avg_temp_Uncer",
                                                  "State":"State",
                                                  "Country":"Country"}).set_index("Date")
cleanUS_temp_df

            Avg_temp  Avg_temp_Uncer    State        Country
Date
1930-01-01     6.993           0.335  Alabama  United States
1930-02-01    11.584           0.241  Alabama  United States
1930-03-01    10.817           0.143  Alabama  United States
1930-04-01    17.718           0.335  Alabama  United States
1930-05-01    21.984           0.222  Alabama  United States
...              ...             ...      ...            ...
2013-05-01    10.607           0.208  Wyoming  United States
2013-06-01    16.267           0.276  Wyoming  United States
2013-07-01    20.222           0.133  Wyoming  United States
2013-08-01    19.621           0.217  Wyoming  United States
2013-09-01    15.811           1.101  Wyoming  United States

[51253 rows x 4 columns]

In [10]:
# Format the columns.
cleanUS_temp_df["Avg_temp"] = cleanUS_temp_df["Avg_temp"].map("{:.2f}".format)
cleanUS_temp_df["Avg_temp_Uncer"] = cleanUS_temp_df["Avg_temp_Uncer"].map("{:.2f}".format)
cleanUS_temp_df

           Avg_temp Avg_temp_Uncer    State        Country
Date
1930-01-01     6.99           0.34  Alabama  United States
1930-02-01    11.58           0.24  Alabama  United States
1930-03-01    10.82           0.14  Alabama  United States
1930-04-01    17.72           0.34  Alabama  United States
1930-05-01    21.98           0.22  Alabama  United States
...             ...            ...      ...            ...
2013-05-01    10.61           0.21  Wyoming  United States
2013-06-01    16.27           0.28  Wyoming  United States
2013-07-01    20.22           0.13  Wyoming  United States
2013-08-01    19.62           0.22  Wyoming  United States
2013-09-01    15.81           1.10  Wyoming  United States

[51253 rows x 4 columns]

In [11]:
# Save in the Resources
cleanUS_temp_df.to_csv(index=True)
filepath = Path('Resources/cleanUS_temp.csv')  
filepath.parent.mkdir(parents=True, exist_ok=True)  
cleanUS_temp_df.to_csv(filepath)

In [12]:
from sqlalchemy import create_engine

In [13]:
from config import db_password

In [14]:
db_string = f"postgresql://postgres:{db_password}@127.0.0.1:5432/climate_change_db"

In [15]:
engine = create_engine(db_string)

In [16]:
cleanUS_temp_df.to_sql(name='cleanUS_temp', con=engine)